Dolomonti/ESP32s3-Lawnmower/src/main.cpp
/*
    Configure the default active state of each skill here.
    Set to 'true' to have the skill active by default, or 'false' otherwise.
    Modify these values to change which skills are active on startup.
*/

const bool DEFAULT_SKILL1_ACTIVE = false;
const bool DEFAULT_SKILL2_ACTIVE = false;
const bool DEFAULT_SKILL3_ACTIVE = false;
const bool DEFAULT_SKILL4_ACTIVE = false;
const bool DEFAULT_SKILL5_ACTIVE = false;
const bool DEFAULT_SKILL6_ACTIVE = false;
const bool DEFAULT_SKILL7_ACTIVE = false;
const bool DEFAULT_SKILL8_ACTIVE = true; // Skill 8 active by default, Capsizing     ALL OFF
const bool DEFAULT_SKILL9_ACTIVE = false;

// ########################## END DEFAULT SKILL ACTIVATION ##########################


HardwareSerial HoverSerial(1);        // Use UART1 for hoverboard communication

// Global variables
uint8_t idx = 0;
uint16_t bufStartFrame;
byte *p;  // Pointer for serial data parsing in Receive()
byte incomingByte;
byte incomingBytePrev;

bool button1State = false;
bool button2State = false;



unsigned long lastHeartbeat = 0;

///////////////////////MAC ADRESS INSERT HERE//////////////////////////

struct Device {
    uint8_t mac[6]; // MAC address of the device
    int id;         // ID associated with the device
};

Device deviceList[] = {
    {{0x48, 0x27, 0xE2, 0xE9, 0x11, 0x9C}, 1},
    {{0xFC, 0xB4, 0x67, 0x73, 0xF1, 0x10}, 2},
    {{0xDC, 0xDA, 0x0C, 0x52, 0xDE, 0x84}, 3},
    {{0x30, 0xC6, 0xF7, 0x25, 0xFD, 0xF8}, 4},
    //add new Mac Address devices here
};

int deviceID = -1;  // Variable to store the assigned device ID

const int numberOfPeers = sizeof(deviceList) / sizeof(deviceList[0]); // Define the number of peers

// NEW: Struct to hold all peer-related information
struct PeerInfo {
    bool isConnected;
    unsigned long lastSeen;
    int reconnectAttempts;
    unsigned long lastReconnectAttempt;
};
PeerInfo peers[numberOfPeers]; // Array to track each peer's state


///////////////////////////////////////////////////////////////////


// Function prototypes
void saveSettings();
void loadSettings();
void monitorDirectionChange(float yaw);
void holdTheLine(float yaw);
void holdPositionMovement(float yaw);
void resetHorizon();
void resetAll();
void core1WiFiTask(void * parameter);
void Send(int16_t uSteer, int16_t uSpeed);
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len);
void resetDevice(AsyncWebServerRequest *request);
void handleResetWifi(AsyncWebServerRequest *request);
extern const char webpage[] PROGMEM; // Correct declaration for an array in program memory
void handleSystemStatus(int16_t battery, int16_t temp, int16_t battery_temp, int16_t blade_battery, int16_t blade_temp, int16_t blade_battery_temp);
void handleWebpage(AsyncWebServerRequest *request);
void connectToWiFi(const char* ssid, const char* password);
void logToWebpage(const String& message);
void espNowTask(void *pvParameters);
void mpuReadTask(void *parameter);
void statusTask(void *pvParameters);
void controlLogicTask(void *pvParameters); // Neue Zeile hinzugefügt

//Gyro Initialization

MPU6050 mpu;

bool dmpReady = false;  // Set true if DMP is initialized successfully
uint8_t devStatus;      // Return status after each device operation (0 = success, !0 = error)
uint16_t packetSize;    // Expected DMP packet size (default is 42 bytes)
uint16_t fifoCount;     // Count of all bytes currently in FIFO
uint8_t fifoBuffer[64]; // FIFO storage buffer
SemaphoreHandle_t mpuSemaphore = NULL; // Semaphore to signal MPU data is ready
float lastError = 0.0f;
unsigned long lastPdTime = 0;

Quaternion q;           // [w, x, y, z] quaternion container
VectorFloat gravity;    // [x, y, z] gravity vector
float ypr[3];           // [yaw, pitch, roll] container and gravity vector

// Global yaw, pitch, and roll offsets
float yawOffset = 0.0;
float pitchOffset = 0.0;
float rollOffset = 0.0;

// Global variables for yaw, pitch, roll
float yaw = 0.0, pitch = 0.0, roll = 0.0;

// Case-related variables

bool skill8Active = false;        // State of Skill 8
bool skill8SafetyActive = false;      // Safety signal active state (sending stop commands)
bool hoverboardInverted = false;      // To detect capsizing

int currentCase = 0;          // Case trigger variable (1, 2, 3, 4, or 5)
bool monitorDirection = false;      // Flag for Cases 2 and 4
bool holdLine = false;              // Flag for Case 3
bool holdPosition = false;          // Flag for Case 5 (triggered via Remote)
float targetAngle = 0;              // Target angle for Cases 2 and 4
int turnDirection = 0;              // direction achange awareness
float startYaw = 0;                 // Initial yaw for Cases 3 and 5
float cumulativeYaw = 0;            // Cumulative yaw for Case 5
unsigned long case3StartTime = 0;   // Timer for Case 3 delay
unsigned long lastSerialUpdate = 0;       // Timer for serial updates


unsigned long capsizeDetectTime = 0; // 


 

// Hoverboard Uart Serial output structure (perhaps only with TTL adapter; not working atm)
// WICHTIG: __attribute__((packed)) hinzugefügt, um exakt 18 Bytes zu garantieren
typedef struct __attribute__((packed)) {
  uint16_t start;
  int16_t cmd1;
  int16_t cmd2;
  int16_t speedR_meas;
  int16_t speedL_meas;
  int16_t batVoltage;
  int16_t boardTemp;
  uint16_t cmdLed;
  uint16_t checksum;
} SerialFeedback;
SerialFeedback Feedback;
SerialFeedback NewFeedback;


bool skillActive = false;       // True if skill 2,3,4 is active
int currentSkill = 0;           // Which skill is active (2, 3, or 4)
int skillSteer = 0;             // Steering override generated by skill logic
// --- Input-Quellen klar getrennt (Refactoring Task 2.2) ---
volatile int16_t input_EspNowSpeed = 0;   // war: input_EspNowSpeed
volatile int16_t input_EspNowSteer = 0;   // war: input_EspNowSteer
volatile int16_t input_JoySpeed = 0;      // war: input_JoySpeed
volatile int16_t input_JoySteer = 0;      // war: input_JoySteer 
volatile bool hoverboardIsBusy = false; 
volatile int16_t feedbackDistL = 0;
volatile int16_t feedbackDistR = 0;       // FIX: Fehlte in deiner Liste
volatile unsigned long skill20StartTime = 0; // FIX: Fehlte in deiner Liste
volatile bool resetMissionFlags = false;    // FIX: Fehlte in deiner Liste
// --------------------------------------------------------------------------------


unsigned long lastJoystickCommandTime = 0;


// Timeout for Peer Connection
const unsigned long peerTimeout = 15000; // Timeout duration for each peer (15 seconds)
const unsigned long reconnectInterval = 2000; // Time between reconnect attempts
const int maxReconnectAttempts = 1; // Max reconnect attempts

volatile int16_t corrected_batVoltage = 0; // Stores the corrected voltage for the web UI
volatile int32_t global_blade_voltage_mv = 0; // Speichert den Wert in Millivolt (z.B. 24000 für 24V)
volatile float current_speed_kmh = 0.0; // Stores the calculated speed in km/h

