Dolomonti/ESP32s3-Lawnmower/src/main.cpp
//Buffer Synchronization with Mutex: Synchronize shared buffers using a mutex to avoid data corruption
SemaphoreHandle_t bufferMutex = xSemaphoreCreateMutex();
// In der Nähe Ihrer anderen Mutex-Deklarationen
SemaphoreHandle_t i2cMutex;



// Example: a function to clear skill states
// *** TASK 3.1: Funktion checkWebSocketConnection() entfernt, direkt ws.cleanupClients() verwenden ***
void readWiFiCredentialsFromEEPROM() {
    for (int i = 0; i < 31; i++) {  // Only read 31 chars to leave room for null terminator
        stored_ssid[i] = char(EEPROM.read(SSID_ADDR + i));
        stored_password[i] = char(EEPROM.read(PASSWORD_ADDR + i));
    }
    // Explicitly null-terminate both strings
    stored_ssid[31] = '\0';
    stored_password[31] = '\0';
}


void writeWiFiCredentialsToEEPROM(const char *ssid, const char *password) {
    // Schreiben Sie die SSID- und Passwort-Zeichenfolgen in den EEPROM.
    // Sicherheitsfix: Länge validieren und null-terminieren
    size_t ssidLen = strlen(ssid);
    size_t passwordLen = strlen(password);

    // Warnung wenn zu lang
    if (ssidLen >= 32 || passwordLen >= 32) {
        if (ENABLE_DEBUG_SERIAL) debugPrintln("WARNING: WiFi credentials truncated (max 31 chars)");
    }

    // Schreiben mit Null-Terminierung
    for (int i = 0; i < 32; i++) {
        EEPROM.write(SSID_ADDR + i, i < ssidLen ? ssid[i] : 0);
        EEPROM.write(PASSWORD_ADDR + i, i < passwordLen ? password[i] : 0);
    }

    // Übertragen Sie die Änderungen in den permanenten Speicher und überprüfen Sie den Erfolg.
    if (EEPROM.commit()) {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrintln("WiFi credentials successfully saved to EEPROM.");
          logToWebpage("WiFi credentials saved."); // Informiert auch die Webseite
        }
    } else {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrintln("ERROR: Failed to save WiFi credentials to EEPROM.");
          logToWebpage("Error: Failed to save WiFi credentials."); // Informiert die Webseite über den Fehler
        }
    }
}

// ESP-NOW Send Callback (required but unused - no action needed)
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
    // Callback is registered but no action required
    (void)mac_addr; (void)status; // Suppress unused parameter warnings
}


// REVISED PEER MANAGEMENT LOGIC
void managePeers() {
    unsigned long currentMillis = millis();

    if (xSemaphoreTake(espNowMutex, (TickType_t)50) != pdTRUE) {
        return; // Could not get mutex, try again later
    }

    for (int i = 0; i < numberOfPeers; i++) {
        // >>> FIX 1: Skip trying to manage our own MAC address
        if (deviceList[i].id == deviceID) {
            continue;
        }

        // 1. Check for timeout if currently connected
        if (peers[i].isConnected && (currentMillis - peers[i].lastSeen > peerTimeout)) {
            peers[i].isConnected = false;
            peers[i].reconnectAttempts = 0; // Reset attempts on disconnect
            if (ENABLE_DEBUG_SERIAL) {
                debugPrintf("Peer %d timed out.\n", deviceList[i].id);
            }
        }

        // 2. Attempt to reconnect (Status-Update ohne Re-Init)
        if (!peers[i].isConnected) {
            if (currentMillis - peers[i].lastReconnectAttempt > reconnectInterval) {
                peers[i].lastReconnectAttempt = currentMillis;
                // Wir löschen den Peer NICHT mehr. ESP-NOW merkt von selbst, 
                // wenn das Gerät wieder in Reichweite ist und sendet.
                if (ENABLE_DEBUG_SERIAL && peers[i].reconnectAttempts == 0) {
                    debugPrintf("Peer %d marked as OFFLINE. Waiting for signal...\n", deviceList[i].id);
                    peers[i].reconnectAttempts = 1; // Nur einmal loggen
                }
            }
        }
    }
    xSemaphoreGive(espNowMutex);
}


/**
 * @brief Saves the current settings structure AND a CRC32 checksum to EEPROM.
 */
void saveSettings() {
    // 1. Berechne den CRC32 der Einstellungs-Struktur
    uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));

    // 2. Schreibe die Struktur an ihre Adresse
    EEPROM.put(SETTINGS_ADDR, currentSettings);
    
    // 3. Schreibe den berechneten CRC direkt HINTER die Struktur
    EEPROM.put(SETTINGS_ADDR + sizeof(Settings), calculated_crc);

    // 4. Änderungen bestätigen
    if (EEPROM.commit()) {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Settings and CRC successfully saved to EEPROM.");
        }
    } else {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Error saving settings to EEPROM.");
        }
    }
}
/**
 * @brief Loads settings from EEPROM or initializes with defaults if CRC check fails.
 */

void loadSettings() {
    // 1. Lade die Einstellungs-Struktur
    EEPROM.get(SETTINGS_ADDR, currentSettings);

    // 2. Lade den gespeicherten CRC (der direkt dahinter liegt)
    uint32_t saved_crc;
    EEPROM.get(SETTINGS_ADDR + sizeof(Settings), saved_crc);

    // 3. Berechne den CRC der Struktur, die wir gerade geladen haben
    uint32_t calculated_crc = esp_crc32_le(0, (uint8_t*)&currentSettings, sizeof(Settings));

    // 4. Vergleiche den gespeicherten CRC mit dem neu berechneten CRC.
    if (calculated_crc != saved_crc || currentSettings.magic != 0xDEADBEEF) {
        
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("EEPROM data invalid or CRC mismatch! Loading defaults.");
        }

        // *** SICHERHEIT: Struct zurücksetzen vor Default-Zuweisung ***
        memset(&currentSettings, 0, sizeof(Settings));

        // --- Set Default Values --- 
        currentSettings.magic = 0xDEADBEEF; 

        // Drive System Defaults
        currentSettings.driveBatteryFactor = 1.0; // Korrekturwert für 37.0V
        currentSettings.driveMinShutdownVoltage = 3100;
        currentSettings.driveSafetyModeVoltage = 3250;
        currentSettings.driveHighVoltage = 4300;
        currentSettings.driveEmergencyLowTemp = 200;
        currentSettings.driveSafetyModeTemp = 1000;
        currentSettings.driveHighTemp = 5000;

