Dolomonti/ESP32s3-Lawnmower/src/main.cpp
        // Blade System Defaults
        currentSettings.bladeBatteryFactor = 6.40; // Korrekturwert für 14.84V
        currentSettings.bladeMinShutdownVoltage = 1200;
        currentSettings.bladeSafetyModeVoltage = 1300;
        currentSettings.bladeHighVoltage = 1680;
        currentSettings.bladeEmergencyLowTemp = 500;
        currentSettings.bladeSafetyModeTemp = 1000;
        currentSettings.bladeHighTemp = 5000;

        // Speed & Steer Defaults
        currentSettings.maxSpeed = MAX_SPEED;
        currentSettings.maxSteer = MAX_STEER;
        currentSettings.currentMaxSpeed = 200;
        currentSettings.currentMaxSteer = 200;

        // Blade Speeds & Reset Timing
        currentSettings.bladeWorkingSpeed = 1600;
        currentSettings.bladeStage2Speed = 1700;
        currentSettings.bladeMaxSpeed = 1800;
        currentSettings.bladeCableResetRpm = 1800;
        currentSettings.bladeResetRampS = 3;      
        currentSettings.bladeResetDurationS = 1;  

        // Capsize Settings
        currentSettings.capsizeAngle = 60.0;
        currentSettings.capsizeTimeout = 1500;

        // PD-Gains
        currentSettings.Kp = 4.0;
        currentSettings.Kd = 1.5;

        currentSettings.apiKey[0] = '\0'; // Init API Key empty

        // Speichere die neuen Standardwerte
        saveSettings();
    } else {
        if (ENABLE_DEBUG_SERIAL) {
            debugPrintln("Successfully loaded settings from EEPROM (CRC OK).");
        }
    }
}


/////////////////////////TRIGGER SKILLS Logic//////////////////////////////////////////////

/////////////////////////TRIGGER SKILLS Logic//////////////////////////////////////////////

// ---------------------------------------------------------------------
// Sub-Handler 1: Drive & Movement Skills (0, 1, 2, 3, 4, 20)
// ---------------------------------------------------------------------
void handleDriveSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4, int16_t param5, int16_t param6) {
    switch (skill) {
        case 0:
            if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 0: undefined placeholder.");
            break;
        case 1:
            if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 1: Full System Stop & Reset Triggered.");
            resetAll();
            resetHorizon();
            if (skill8SafetyActive) {
                skill8SafetyActive = false;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("--> Emergency Stop cleared by reset.");
            }
            if (!skill8Active) {
                skill8Active = true;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("--> Capsize monitoring (Skill 8) reactivated by reset.");
            }
            hoverboardInverted = false; 
            break;
        case 2:
            if (!skill8Active) { debugPrintln("Skill 2 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            resetAll(); resetHorizon();
            input_EspNowSpeed = 0; 
            skillActive = true; currentCase = 2;
            if (param1 > 0) { targetAngle = + 90.0; turnDirection = 1; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 2: 90-degree turn RIGHT triggered!"); }
            else if (param1 < 0) { targetAngle = - 90.0; turnDirection = -1; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 2: 90-degree turn LEFT triggered!"); }
            if (targetAngle > 180) targetAngle -= 360;
            if (targetAngle < -180) targetAngle += 360;
            monitorDirection = true;
            break;
        case 3:
            if (!skill8Active) { debugPrintln("Skill 3 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            if (holdLine) {
                resetAll();
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 3: Deactivated (no longer holding the line).");
            } else {
                resetAll(); holdLine = true; skillActive = true; currentCase = 3;
                resetHorizon(); startYaw = yaw; case3StartTime = millis();
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 3: Activated (holding the line).");
            }
            break;
        case 4:
            if (!skill8Active) { debugPrintln("Skill 4 cannot be activated: Capsize protection (Skill 8) is not active."); break; }
            resetAll(); resetHorizon();
            input_EspNowSpeed = 0; 
            skillActive = true; currentCase = 4;
            if (param1 > 0) { targetAngle = + 180.0; turnDirection = 1; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 4: 180-degree turn RIGHT triggered!"); }
            else if (param1 < 0) { targetAngle = - 180.0; turnDirection = -1; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 4: 180-degree turn LEFT triggered!"); }
            if (targetAngle > 180) targetAngle -= 360;
            if (targetAngle < -180) targetAngle += 360;
            monitorDirection = true;
            break;
        case 20: 
            resetMissionFlags = true;
            input_JoySteer = 0; 
            input_JoySpeed = 0; 
            input_EspNowSteer = (param1 > 0) ? 100 : (param1 < 0 ? -100 : 0);
            input_EspNowSpeed = (param2 > 0) ? 100 : (param2 < 0 ? -100 : 0);
            global_cmdCode = 0; 
            Send(input_EspNowSteer, input_EspNowSpeed);
            vTaskDelay(pdMS_TO_TICKS(50)); 
            if (ENABLE_DEBUG_SERIAL) debugPrintf(">>> MISSION KICKSTARTED & SET: L:%d R:%d\n", param1, param2);
            input_EspNowSteer = param1; 
            input_EspNowSpeed = param2; 
            global_maxSpeedL = (param3 > 0) ? param3 : currentSettings.currentMaxSpeed;
            global_maxSpeedR = (param4 > 0) ? param4 : currentSettings.currentMaxSpeed;
            global_accel     = (uint16_t)constrain(param5, 0, 100); 
            global_brake     = (uint16_t)constrain(param6, 0, 100);
            global_cmdCode    = 2;    
            skill20StartTime  = millis(); 
            skillActive       = true; 
            currentSkill      = 20;
            if (ENABLE_DEBUG_SERIAL) debugPrintf(">>> MISSION: L:%dcm R:%dcm | Spd L:%d R:%d | Acc:%d%% Brk:%d%%\n", param1, param2, global_maxSpeedL, global_maxSpeedR, global_accel, global_brake);
            break;
    }
}

// ---------------------------------------------------------------------
// Sub-Handler 2: Blade & Actuator Skills (5, 6, 10, 11)
// ---------------------------------------------------------------------
void handleBladeSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4) {
    switch (skill) {
        case 5:
            if (param1 > 0) {
                digitalWrite(BLADE_DOWN_PIN, LOW); digitalWrite(BLADE_UP_PIN, HIGH); currentBladeHeight = BLADE_HEIGHT_UP;
                currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); bladeEsc.writeMicroseconds(BLADE_ZERO_US);
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade UP (Pin 35 HIGH) - forcing Blade OFF for safety.");
            } else if (param1 < 0) {
                digitalWrite(BLADE_UP_PIN, LOW); digitalWrite(BLADE_DOWN_PIN, HIGH); currentBladeHeight = BLADE_HEIGHT_DOWN;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade DOWN (Pin 36 HIGH).");
            } else {
                digitalWrite(BLADE_UP_PIN, LOW); digitalWrite(BLADE_DOWN_PIN, LOW);
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 5: Blade Height STOP (Pins LOW).");
            }
            break; 
        case 6: { 
            uint16_t rawKey = (uint16_t)param1; int16_t key = (int16_t)param1;
            auto bladeAllowed = []() -> bool { return (currentBladeHeight == BLADE_HEIGHT_DOWN); };
            if (key == -1) { 
                currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); current_blade_pwm = BLADE_ZERO_US;
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Unit OFF (Pin 19 LOW)");
            } else if (key == 1) {
                if (bladeAllowed()) { currentBladeState = BLADE_WORK; digitalWrite(BLADE_UNIT_PIN, HIGH); current_blade_pwm = BLADE_ZERO_US; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Unit ON (Pin 19 HIGH)"); } 
                else { currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); current_blade_pwm = BLADE_ZERO_US; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade ON blocked - blade is UP (safety)"); }
            } else if (key >= 21000 && key <= 22000) {
                if (bladeAllowed()) { currentBladeState = BLADE_WORK; current_blade_pwm = key - 20000; if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Web-PWM-> %d PWM\n", current_blade_pwm); } 
                else { currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); current_blade_pwm = BLADE_ZERO_US; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Web-PWM blocked - blade is UP (safety)"); }
            } else if (key == 25600 || key == 2) { 
                if (bladeAllowed()) { currentBladeState = BLADE_WORK; current_blade_pwm = currentSettings.bladeWorkingSpeed; if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Blade Speed 1 -> %d PWM\n", current_blade_pwm); } 
                else { currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); current_blade_pwm = BLADE_ZERO_US; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Speed 1 blocked - blade is UP (safety)"); }
            } else if (key == 26500 || key == 3) { 
                if (bladeAllowed()) { currentBladeState = BLADE_WORK; current_blade_pwm = currentSettings.bladeStage2Speed; if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 6: Blade Speed 2 -> %d PWM\n", current_blade_pwm); } 
                else { currentBladeState = BLADE_OFF; digitalWrite(BLADE_UNIT_PIN, LOW); current_blade_pwm = BLADE_ZERO_US; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 6: Blade Speed 2 blocked - blade is UP (safety)"); }
            }
            break; 
        }
        case 10:
            currentSettings.bladeWorkingSpeed = param1; currentSettings.bladeStage2Speed = param2; currentSettings.bladeMaxSpeed = param3; currentSettings.bladeCableResetRpm = param4; saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 10: Blade speeds updated - Zero: %d, Working pwm: %d, 2 Stage pwm: %d, Max pwm: %d, Reset pwm: %d\n", BLADE_ZERO_US, currentSettings.bladeWorkingSpeed, currentSettings.bladeStage2Speed, currentSettings.bladeMaxSpeed, currentSettings.bladeCableResetRpm);
            break;
        case 11:
            if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 11: Reset triggered. Stopping blade and starting sequence...");
            current_blade_pwm = BLADE_ZERO_US; bladeEsc.writeMicroseconds(BLADE_ZERO_US);
            currentBladeState = BLADE_CABLE_RESET; bladeSequenceStartTime = millis();
            if (param1 > 1000) currentSettings.bladeCableResetRpm = param1;
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 11: Blade Reset Sequence started. Target: %d PWM\n", currentSettings.bladeCableResetRpm);
            break;
    }
}

// ---------------------------------------------------------------------
// Sub-Handler 3: Setup & System Skills (7, 8, 9, 12-19)
// ---------------------------------------------------------------------
void handleSetupSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4, int16_t param5, int16_t param6) {
    switch (skill) {
        case 7:
            if (param3 > 0) currentSettings.currentMaxSpeed = constrain(param3, 0, MAX_SPEED);
            if (param2 > 0) currentSettings.currentMaxSteer = constrain(param2, 0, MAX_STEER);
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 7: Updated currentMaxSpeed to %d and currentMaxSteer to %d\n", currentSettings.currentMaxSpeed, currentSettings.currentMaxSteer);
            break;
        case 8:
            if (param1 == 1000) { currentSettings.capsizeAngle = (float)param2; saveSettings(); if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 8: Capsize Angle set to %.2f degrees.\n", currentSettings.capsizeAngle); return; }
            if (param1 == 1001) { currentSettings.capsizeTimeout = param2; saveSettings(); if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 8: Capsize Timeout set to %d ms.\n", currentSettings.capsizeTimeout); return; }
            
