Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            if (param1 == 20) {
                resetAll(); digitalWrite(BLADE_UNIT_PIN, LOW); digitalWrite(DRIVE_UNIT_PIN, LOW);
                currentBladeState = BLADE_OFF; bladeEsc.writeMicroseconds(BLADE_ZERO_US); skill8SafetyActive = true;
                static unsigned long lastEstopPrint = 0; unsigned long now = millis();
                if (ENABLE_DEBUG_SERIAL && (now - lastEstopPrint > 2000)) { debugPrintln("--> IMMEDIATE EMERGENCY STOP TRIGGERED <--"); lastEstopPrint = now; }
            } else if (param1 > 0) {
                if (!skill8Active) { resetAll(); skill8Active = true; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 8: Activated (Capsize MPU monitoring started)."); }
            } else if (param1 == -20) {
                if (ENABLE_DEBUG_SERIAL) debugPrintln("Stop/Reset command received: Stopping skills, resetting horizon, clearing E-Stop.");
                resetAll(); resetHorizon();
                if (skill8SafetyActive) { skill8SafetyActive = false; if (ENABLE_DEBUG_SERIAL) debugPrintln("--> Emergency Stop state has been cleared."); }
            } else if (param1 < 0) {
                if (skill8Active) { skill8Active = false; hoverboardInverted = false; skill8SafetyActive = false; if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 8: Deactivated (Capsize MPU monitoring stopped)."); }
            } else {
                debugPrintln("Skill 8: Undefined command, requires a non-zero value.");
            }
            break;
        case 9:
            if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 9 triggered via Webpage. Restarting ESP32...");
            ESP.restart();
            break;
        case 12:
            currentSettings.driveMinShutdownVoltage = param1; currentSettings.driveSafetyModeVoltage = param2; currentSettings.driveHighVoltage = param3; currentSettings.driveEmergencyLowTemp = param4; currentSettings.driveSafetyModeTemp = param5; currentSettings.driveHighTemp = param6; saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 12: Drive settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n", currentSettings.driveMinShutdownVoltage, currentSettings.driveSafetyModeVoltage, currentSettings.driveHighVoltage, currentSettings.driveEmergencyLowTemp, currentSettings.driveSafetyModeTemp, currentSettings.driveHighTemp);
            break;
        case 13:
            currentSettings.bladeMinShutdownVoltage = param1; currentSettings.bladeSafetyModeVoltage = param2; currentSettings.bladeHighVoltage = param3; currentSettings.bladeEmergencyLowTemp = param4; currentSettings.bladeSafetyModeTemp = param5; currentSettings.bladeHighTemp = param6; saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 13: Blade settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n", currentSettings.bladeMinShutdownVoltage, currentSettings.bladeSafetyModeVoltage, currentSettings.bladeHighVoltage, currentSettings.bladeEmergencyLowTemp, currentSettings.bladeSafetyModeTemp, currentSettings.bladeHighTemp);
            break;
        case 14:
            currentSettings.capsizeAngle = (float)param1; currentSettings.capsizeTimeout = param2; saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 14: Capsize parameters updated - Angle: %.2f, Timeout: %d\n", currentSettings.capsizeAngle, currentSettings.capsizeTimeout);
            break;
        case 15:
            if (param1 > 0) currentSettings.Kp = (float)param1 / 100.0f;
            if (param2 > 0) currentSettings.Kd = (float)param2 / 100.0f;
            saveSettings();
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 15: PD-Regler aktualisiert - Kp: %.2f, Kd: %.2f\n", currentSettings.Kp, currentSettings.Kd);
            break;
        case 16: 
            if (param1 > 0) { currentSettings.bladeBatteryFactor = (float)param1 / 100.0; saveSettings(); if (ENABLE_DEBUG_SERIAL) debugPrintf("Neuer Blade Batterie Faktor: %.2f\n", currentSettings.bladeBatteryFactor); }
            break;
        case 17: 
            if (param1 > 0) { currentSettings.driveBatteryFactor = (float)param1 / 1000.0; saveSettings(); debugPrintf("Neuer Drive Faktor: %.3f\n", currentSettings.driveBatteryFactor); }
            break;
        case 18: 
            if (param1 > 0) { digitalWrite(DRIVE_UNIT_PIN, HIGH); if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 18: Drive Unit Power ON (Pin 20 HIGH)"); } 
            else { digitalWrite(DRIVE_UNIT_PIN, LOW); if (ENABLE_DEBUG_SERIAL) debugPrintln("Skill 18: Drive Unit Power OFF (Pin 20 LOW)"); }
            break;
        case 19:
            global_cmdCode = (uint16_t)param1; global_accel = (uint16_t)param2; global_brake = (uint16_t)param3;
            if (ENABLE_DEBUG_SERIAL) debugPrintf("Skill 19: Parameters updated -> Cmd: %d, Accel: %d, Brake: %d\n", global_cmdCode, global_accel, global_brake);
            break;
    }
}

// ---------------------------------------------------------------------
// HAUPT-VERTEILER (Der Ersatz für das Spaghetti-Monster)
// ---------------------------------------------------------------------
void triggerSkill(uint8_t skill, int16_t param1 = 0, int16_t param2 = 0, int16_t param3 = 0, int16_t param4 = 0, int16_t param5 = 0, int16_t param6 = 0) {
    if (skill <= 4 || skill == 20) {
        handleDriveSkills(skill, param1, param2, param3, param4, param5, param6);
    } else if (skill == 5 || skill == 6 || skill == 10 || skill == 11) {
        handleBladeSkills(skill, param1, param2, param3, param4);
    } else {
        handleSetupSkills(skill, param1, param2, param3, param4, param5, param6);
    }
}

// --- Die Send-Funktion passt sich dem cmdCode an ---
void Send(int16_t uSteer, int16_t uSpeed) {
    static unsigned long lastHeartbeatSend = 0;
    if (millis() - lastHeartbeatSend < 50) return; 
    lastHeartbeatSend = millis();

    if (isHighVoltageShutdown || skill8SafetyActive) {
        uSteer = 0; uSpeed = 0;
    }

    // *** TASK 1.1: Mutex-Schutz für UART-Kommunikation ***
    if (xSemaphoreTake(bufferMutex, (TickType_t)10) == pdTRUE) {
        Command.start     = 0xABCD;
        Command.cmdCode   = (int16_t)global_cmdCode; 
        
        // *** REFACTORED: Send() verwendet stumpf die übergebenen Parameter ***
        // Die Entscheidung was übergeben wird, liegt beim Aufrufer (controlLogicTask)
        Command.steer = uSteer;
        Command.speed = uSpeed;

        // Zuweisung aller Parameter für die binäre Übertragung
        Command.maxSpeedL = global_maxSpeedL;
        Command.maxSpeedR = global_maxSpeedR; // Sicherstellen, dass R auch gesendet wird
        Command.accPct    = (int16_t)global_accel; 
        Command.brkPct    = (int16_t)global_brake;

        // Checksumme muss exakt alle Felder der SerialCommand Struktur im STM32 spiegeln
        Command.checksum = Command.start ^ 
                           Command.cmdCode ^ 
                           Command.steer ^ 
                           Command.speed ^ 
                           Command.maxSpeedL ^ 
                           Command.maxSpeedR ^ 
                           Command.accPct ^ 
                           Command.brkPct;

        // Binäres Paket an den STM32 feuern
        HoverSerial.write((uint8_t *)&Command, sizeof(SerialCommand));
        
        xSemaphoreGive(bufferMutex);
    }
}



void sendESPNow(uint8_t *mac, ESPNowCommand *command) {
    esp_err_t result;

    // Set start frame
    command->start = START_FRAME;

